Table of Contents
 Class LoadOnSurface
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Load on surface
[OpenModelClass("CI.StructModel.Loading.LoadOnSurface,CI.Loading", "CI.StructModel.Loading.ILoadOnSurface,CI.BasicTypes")]
public class LoadOnSurface : OpenElementId
Inheritance
object
OpenObject
OpenElementId
LoadOnSurface
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 LoadOnSurface()
Constructor
public LoadOnSurface()
Properties
 Direction
Load direction LCS or GCS
public LoadDirection Direction { get; set; }
Property Value
LoadDirection
 Fx
Force in X direction
public double Fx { get; set; }
Property Value
double
 Fy
Force in Y direction
public double Fy { get; set; }
Property Value
double
 Fz
Force in Z direction
public double Fz { get; set; }
Property Value
double
 Geometry
Gets, sets geometry of this LoadOnSurface
public Region3D Geometry { get; set; }
Property Value
Region3D
 Edit this page